vanhao-hub/usb_key_authen/src/core/mcxa156/sdks/frdm_mcxa156_sdk/devices/MCXA156/cmsis_drivers/fsl_lpuart_cmsis.c
            result = ARM_DRIVER_OK;
            break;

        default:
            result = ARM_DRIVER_ERROR_UNSUPPORTED;
            break;
    }

    if (!isContinue)
    {
        return result;
    }

    switch (control & ARM_USART_DATA_BITS_Msk)
    {
#if defined(FSL_FEATURE_LPUART_HAS_7BIT_DATA_SUPPORT) && FSL_FEATURE_LPUART_HAS_7BIT_DATA_SUPPORT
        case ARM_USART_DATA_BITS_7:
            config.dataBitsCount = kLPUART_SevenDataBits;
            break;
#endif
        case ARM_USART_DATA_BITS_8:
            config.dataBitsCount = kLPUART_EightDataBits;
            break;

        default:
            result = ARM_USART_ERROR_DATA_BITS;
            break;
    }

    if (result == ARM_USART_ERROR_DATA_BITS)
    {
        return result;
    }

    switch (control & ARM_USART_PARITY_Msk)
    {
        case ARM_USART_PARITY_NONE:
            config.parityMode = kLPUART_ParityDisabled;
            break;
        case ARM_USART_PARITY_EVEN:
            config.parityMode = kLPUART_ParityEven;
            break;
        case ARM_USART_PARITY_ODD:
            config.parityMode = kLPUART_ParityOdd;
            break;
        default:
            result = ARM_USART_ERROR_PARITY;
            break;
    }

    if (result == ARM_USART_ERROR_PARITY)
    {
        return result;
    }

    switch (control & ARM_USART_STOP_BITS_Msk)
    {
        case ARM_USART_STOP_BITS_1:
            /* The GetDefaultConfig has already set for this case. */
            break;
#if defined(FSL_FEATURE_LPUART_HAS_STOP_BIT_CONFIG_SUPPORT) && FSL_FEATURE_LPUART_HAS_STOP_BIT_CONFIG_SUPPORT
        case ARM_USART_STOP_BITS_2:
            config.stopBitCount = kLPUART_TwoStopBit;
            break;
#endif
        default:
            result = ARM_USART_ERROR_STOP_BITS;
            break;
    }

    if (result == ARM_USART_ERROR_STOP_BITS)
    {
        return result;
    }

    /* If LPUART is already configured, deinit it first. */
    if (((*isConfigured) & (uint8_t)USART_FLAG_CONFIGURED) != 0U)
    {
        LPUART_Deinit(resource->base);
        *isConfigured &= ~(uint8_t)USART_FLAG_CONFIGURED;
    }

    config.enableTx = true;
    config.enableRx = true;

    if (kStatus_LPUART_BaudrateNotSupport == LPUART_Init(resource->base, &config, resource->GetFreq()))
    {
        result = ARM_USART_ERROR_BAUDRATE;
    }
    else
    {
        *isConfigured |= (uint8_t)USART_FLAG_CONFIGURED;
    }

    return result;
}

static ARM_DRIVER_VERSION LPUARTx_GetVersion(void)
{
    return s_lpuartDriverVersion;
}

static ARM_USART_CAPABILITIES LPUARTx_GetCapabilities(void)
{
    return s_lpuartDriverCapabilities;
}

static int32_t LPUARTx_SetModemControl(ARM_USART_MODEM_CONTROL control)
{
    return ARM_DRIVER_ERROR_UNSUPPORTED;
}

static ARM_USART_MODEM_STATUS LPUARTx_GetModemStatus(void)
{
    ARM_USART_MODEM_STATUS modem_status = {0};

    return modem_status;
}

#endif

#if ((defined(RTE_USART0_DMA_EN) && RTE_USART0_DMA_EN && (defined(LPUART0) || defined(LPUART_0))) ||    \
     (defined(RTE_USART1_DMA_EN) && RTE_USART1_DMA_EN && (defined(LPUART1) || defined(LPUART_1))) ||    \
     (defined(RTE_USART2_DMA_EN) && RTE_USART2_DMA_EN && (defined(LPUART2) || defined(LPUART_2))) ||    \
     (defined(RTE_USART3_DMA_EN) && RTE_USART3_DMA_EN && (defined(LPUART3) || defined(LPUART_3))) ||    \
     (defined(RTE_USART4_DMA_EN) && RTE_USART4_DMA_EN && (defined(LPUART4) || defined(LPUART_4))) ||    \
     (defined(RTE_USART5_DMA_EN) && RTE_USART5_DMA_EN && (defined(LPUART5) || defined(LPUART_5))) ||    \
     (defined(RTE_USART6_DMA_EN) && RTE_USART6_DMA_EN && (defined(LPUART6) || defined(LPUART_6))) ||    \
     (defined(RTE_USART7_DMA_EN) && RTE_USART7_DMA_EN && (defined(LPUART7) || defined(LPUART_7))) ||    \
     (defined(RTE_USART8_DMA_EN) && RTE_USART8_DMA_EN && (defined(LPUART8) || defined(LPUART_8))) ||    \
     (defined(RTE_USART9_DMA_EN) && RTE_USART9_DMA_EN && (defined(LPUART9) || defined(LPUART_9))) ||    \
     (defined(RTE_USART10_DMA_EN) && RTE_USART10_DMA_EN && (defined(LPUART10) || defined(LPUART_10))) || \
     (defined(RTE_USART11_DMA_EN) && RTE_USART11_DMA_EN && (defined(LPUART11) || defined(LPUART_11))) || \
     (defined(RTE_USART12_DMA_EN) && RTE_USART12_DMA_EN && (defined(LPUART12) || defined(LPUART_12))) || \
     (defined(RTE_USART13_DMA_EN) && RTE_USART13_DMA_EN && (defined(LPUART13) || defined(LPUART_13))) || \
     (defined(RTE_USART14_DMA_EN) && RTE_USART14_DMA_EN && (defined(LPUART14) || defined(LPUART_14))) || \
     (defined(RTE_USART15_DMA_EN) && RTE_USART15_DMA_EN && (defined(LPUART15) || defined(LPUART_15))) || \
     (defined(RTE_USART16_DMA_EN) && RTE_USART16_DMA_EN && (defined(LPUART16) || defined(LPUART_16))) || \
     (defined(RTE_USART17_DMA_EN) && RTE_USART17_DMA_EN && (defined(LPUART17) || defined(LPUART_17))) || \
     (defined(RTE_USART18_DMA_EN) && RTE_USART18_DMA_EN && (defined(LPUART18) || defined(LPUART_18))) || \
     (defined(RTE_USART19_DMA_EN) && RTE_USART19_DMA_EN && (defined(LPUART19) || defined(LPUART_19))) || \
     (defined(RTE_USART20_DMA_EN) && RTE_USART20_DMA_EN && (defined(LPUART20) || defined(LPUART_20))))

#if (defined(FSL_FEATURE_SOC_DMA_COUNT) && FSL_FEATURE_SOC_DMA_COUNT)
static void KSDK_LPUART_DmaCallback(LPUART_Type *base, lpuart_dma_handle_t *handle, status_t status, void *userData)
{
    uint32_t event = 0U;

    if (kStatus_LPUART_TxIdle == status)
    {
        event = ARM_USART_EVENT_SEND_COMPLETE;
    }
    else if (kStatus_LPUART_RxIdle == status)
    {
        event = ARM_USART_EVENT_RECEIVE_COMPLETE;
    }
    else
    {
        /* Avoid MISRA 2012 15.7 violation */
    }

    /* User data is actually CMSIS driver callback. */
    if ((0U != event) && (userData != NULL))
    {
        ((ARM_USART_SignalEvent_t)userData)(event);
    }
}

static int32_t LPUART_DmaInitialize(ARM_USART_SignalEvent_t cb_event, cmsis_lpuart_dma_driver_state_t *lpuart)
{
    if (0U == (lpuart->flags & (uint8_t)USART_FLAG_INIT))
    {
        lpuart->cb_event = cb_event;
        lpuart->flags    = (uint8_t)USART_FLAG_INIT;
    }

    return ARM_DRIVER_OK;
}

