vanhao-hub/usb_key_authen/src/core/mcxa156/sdks/frdm_mcxa156_sdk/devices/MCXA156/cmsis_drivers/fsl_lpuart_cmsis.c
static int32_t LPUART13_DmaPowerControl(ARM_POWER_STATE state)
{
    return LPUART_DmaPowerControl(state, &LPUART13_DmaDriverState);
}

static int32_t LPUART13_DmaSend(const void *data, uint32_t num)
{
    return LPUART_DmaSend(data, num, &LPUART13_DmaDriverState);
}

static int32_t LPUART13_DmaReceive(void *data, uint32_t num)
{
    return LPUART_DmaReceive(data, num, &LPUART13_DmaDriverState);
}

static int32_t LPUART13_DmaTransfer(const void *data_out, void *data_in, uint32_t num)
{
    return LPUART_DmaTransfer(data_out, data_in, num, &LPUART13_DmaDriverState);
}

static uint32_t LPUART13_DmaGetTxCount(void)
{
    return LPUART_DmaGetTxCount(&LPUART13_DmaDriverState);
}

static uint32_t LPUART13_DmaGetRxCount(void)
{
    return LPUART_DmaGetRxCount(&LPUART13_DmaDriverState);
}

static int32_t LPUART13_DmaControl(uint32_t control, uint32_t arg)
{
    return LPUART_DmaControl(control, arg, &LPUART13_DmaDriverState);
}

static ARM_USART_STATUS LPUART13_DmaGetStatus(void)
{
    return LPUART_DmaGetStatus(&LPUART13_DmaDriverState);
}

/* LPUART13 Driver Control Block */

#endif

#if (defined(FSL_FEATURE_SOC_EDMA_COUNT) && FSL_FEATURE_SOC_EDMA_COUNT)

static cmsis_lpuart_edma_resource_t LPUART13_EdmaResource = {
    RTE_USART13_DMA_TX_DMA_BASE,    RTE_USART13_DMA_TX_CH,          RTE_USART13_DMA_TX_PERI_SEL,
    RTE_USART13_DMA_RX_DMA_BASE,    RTE_USART13_DMA_RX_CH,          RTE_USART13_DMA_RX_PERI_SEL,

#if (defined(FSL_FEATURE_SOC_DMAMUX_COUNT) && FSL_FEATURE_SOC_DMAMUX_COUNT)
    RTE_USART13_DMA_TX_DMAMUX_BASE, RTE_USART13_DMA_RX_DMAMUX_BASE,
#endif
};

static lpuart_edma_handle_t LPUART13_EdmaHandle;
static edma_handle_t LPUART13_EdmaRxHandle;
static edma_handle_t LPUART13_EdmaTxHandle;

#if defined(__CC_ARM) || defined(__ARMCC_VERSION)
ARMCC_SECTION("lpuart13_edma_driver_state")
static cmsis_lpuart_edma_driver_state_t LPUART13_EdmaDriverState = {
#else
static cmsis_lpuart_edma_driver_state_t LPUART13_EdmaDriverState = {
#endif
    &LPUART13_Resource, &LPUART13_EdmaResource, &LPUART13_EdmaHandle, &LPUART13_EdmaRxHandle, &LPUART13_EdmaTxHandle,
};

static int32_t LPUART13_EdmaInitialize(ARM_USART_SignalEvent_t cb_event)
{
#ifdef RTE_USART13_PIN_INIT
    RTE_USART13_PIN_INIT();
#endif
    return LPUART_EdmaInitialize(cb_event, &LPUART13_EdmaDriverState);
}

static int32_t LPUART13_EdmaUninitialize(void)
{
#ifdef RTE_USART13_PIN_DEINIT
    RTE_USART13_PIN_DEINIT();
#endif
    return LPUART_EdmaUninitialize(&LPUART13_EdmaDriverState);
}

static int32_t LPUART13_EdmaPowerControl(ARM_POWER_STATE state)
{
    return LPUART_EdmaPowerControl(state, &LPUART13_EdmaDriverState);
}

static int32_t LPUART13_EdmaSend(const void *data, uint32_t num)
{
    return LPUART_EdmaSend(data, num, &LPUART13_EdmaDriverState);
}

static int32_t LPUART13_EdmaReceive(void *data, uint32_t num)
{
    return LPUART_EdmaReceive(data, num, &LPUART13_EdmaDriverState);
}

static int32_t LPUART13_EdmaTransfer(const void *data_out, void *data_in, uint32_t num)
{
    return LPUART_EdmaTransfer(data_out, data_in, num, &LPUART13_EdmaDriverState);
}

static uint32_t LPUART13_EdmaGetTxCount(void)
{
    return LPUART_EdmaGetTxCount(&LPUART13_EdmaDriverState);
}

static uint32_t LPUART13_EdmaGetRxCount(void)
{
    return LPUART_EdmaGetRxCount(&LPUART13_EdmaDriverState);
}

static int32_t LPUART13_EdmaControl(uint32_t control, uint32_t arg)
{
    return LPUART_EdmaControl(control, arg, &LPUART13_EdmaDriverState);
}

static ARM_USART_STATUS LPUART13_EdmaGetStatus(void)
{
    return LPUART_EdmaGetStatus(&LPUART13_EdmaDriverState);
}

#endif

#else

static lpuart_handle_t LPUART13_Handle;

#if defined(USART13_RX_BUFFER_ENABLE) && (USART13_RX_BUFFER_ENABLE == 1)
static uint8_t lpuart13_rxRingBuffer[USART_RX_BUFFER_LEN];
#endif

#if defined(__CC_ARM) || defined(__ARMCC_VERSION)
ARMCC_SECTION("lpuart13_non_blocking_driver_state")
static cmsis_lpuart_non_blocking_driver_state_t LPUART13_NonBlockingDriverState = {
#else
static cmsis_lpuart_non_blocking_driver_state_t LPUART13_NonBlockingDriverState = {
#endif
    &LPUART13_Resource,
    &LPUART13_Handle,
};

static int32_t LPUART13_NonBlockingInitialize(ARM_USART_SignalEvent_t cb_event)
{
#ifdef RTE_USART13_PIN_INIT
    RTE_USART13_PIN_INIT();
#endif
    return LPUART_NonBlockingInitialize(cb_event, &LPUART13_NonBlockingDriverState);
}

static int32_t LPUART13_NonBlockingUninitialize(void)
{
#ifdef RTE_USART13_PIN_DEINIT
    RTE_USART13_PIN_DEINIT();
#endif
    return LPUART_NonBlockingUninitialize(&LPUART13_NonBlockingDriverState);
}

static int32_t LPUART13_NonBlockingPowerControl(ARM_POWER_STATE state)
{
    int32_t result;

    result = LPUART_NonBlockingPowerControl(state, &LPUART13_NonBlockingDriverState);

#if defined(USART13_RX_BUFFER_ENABLE) && (USART13_RX_BUFFER_ENABLE == 1)
    if ((state == ARM_POWER_FULL) && (LPUART13_NonBlockingDriverState.handle->rxRingBuffer == NULL))
    {
        LPUART_TransferStartRingBuffer(LPUART13_NonBlockingDriverState.resource->base,
                                       LPUART13_NonBlockingDriverState.handle, lpuart13_rxRingBuffer,
                                       USART_RX_BUFFER_LEN);
    }
#endif

    return result;
}

static int32_t LPUART13_NonBlockingSend(const void *data, uint32_t num)
{
    return LPUART_NonBlockingSend(data, num, &LPUART13_NonBlockingDriverState);
}

static int32_t LPUART13_NonBlockingReceive(void *data, uint32_t num)
{
    return LPUART_NonBlockingReceive(data, num, &LPUART13_NonBlockingDriverState);
}

static int32_t LPUART13_NonBlockingTransfer(const void *data_out, void *data_in, uint32_t num)
{
    return LPUART_NonBlockingTransfer(data_out, data_in, num, &LPUART13_NonBlockingDriverState);
}

static uint32_t LPUART13_NonBlockingGetTxCount(void)
{
    return LPUART_NonBlockingGetTxCount(&LPUART13_NonBlockingDriverState);
}

static uint32_t LPUART13_NonBlockingGetRxCount(void)
{
    return LPUART_NonBlockingGetRxCount(&LPUART13_NonBlockingDriverState);
}

