vanhao-hub/usb_key_authen/src/core/mcxa156/sdks/frdm_mcxa156_sdk/devices/MCXA156/cmsis_drivers/fsl_lpuart_cmsis.c
static int32_t LPUART13_NonBlockingControl(uint32_t control, uint32_t arg)
{
    int32_t result;

    result = LPUART_NonBlockingControl(control, arg, &LPUART13_NonBlockingDriverState);
    if (ARM_DRIVER_OK != result)
    {
        return result;
    }

    /* Enable the receive interrupts if ring buffer is used */
    if (LPUART13_NonBlockingDriverState.handle->rxRingBuffer != NULL)
    {
        LPUART_EnableInterrupts(
            LPUART13_NonBlockingDriverState.resource->base,
            (uint32_t)kLPUART_RxDataRegFullInterruptEnable | (uint32_t)kLPUART_RxOverrunInterruptEnable);
    }

    return ARM_DRIVER_OK;
}

static ARM_USART_STATUS LPUART13_NonBlockingGetStatus(void)
{
    return LPUART_NonBlockingGetStatus(&LPUART13_NonBlockingDriverState);
}

#endif

ARM_DRIVER_USART Driver_USART13 = {LPUARTx_GetVersion,      LPUARTx_GetCapabilities,
#if defined(RTE_USART13_DMA_EN) && RTE_USART13_DMA_EN
#if (defined(FSL_FEATURE_SOC_EDMA_COUNT) && FSL_FEATURE_SOC_EDMA_COUNT)
                                   LPUART13_EdmaInitialize, LPUART13_EdmaUninitialize, LPUART13_EdmaPowerControl,
                                   LPUART13_EdmaSend,       LPUART13_EdmaReceive,      LPUART13_EdmaTransfer,
                                   LPUART13_EdmaGetTxCount, LPUART13_EdmaGetRxCount,   LPUART13_EdmaControl,
                                   LPUART13_EdmaGetStatus,
#else
                                   LPUART13_DmaInitialize,  LPUART13_DmaUninitialize, LPUART13_DmaPowerControl,
                                   LPUART13_DmaSend,        LPUART13_DmaReceive,      LPUART13_DmaTransfer,
                                   LPUART13_DmaGetTxCount,  LPUART13_DmaGetRxCount,   LPUART13_DmaControl,
                                   LPUART13_DmaGetStatus,
#endif /* FSL_FEATURE_SOC_EDMA_COUNT */
#else
                                  LPUART13_NonBlockingInitialize,
                                  LPUART13_NonBlockingUninitialize,
                                  LPUART13_NonBlockingPowerControl,
                                  LPUART13_NonBlockingSend,
                                  LPUART13_NonBlockingReceive,
                                  LPUART13_NonBlockingTransfer,
                                  LPUART13_NonBlockingGetTxCount,
                                  LPUART13_NonBlockingGetRxCount,
                                  LPUART13_NonBlockingControl,
                                  LPUART13_NonBlockingGetStatus,
#endif /* RTE_USART13_DMA_EN */
                                   LPUARTx_SetModemControl, LPUARTx_GetModemStatus};

#endif /* LPUART13 */

#if (defined(LPUART14) || defined(LPUART_14)) && defined(RTE_USART14) && RTE_USART14

/* User needs to provide the implementation for LPUART14_GetFreq/InitPins/DeinitPins
in the application for enabling according instance. */
extern uint32_t LPUART14_GetFreq(void);

#if defined(LPUART14)
static cmsis_lpuart_resource_t LPUART14_Resource = {LPUART14, LPUART14_GetFreq};
#elif defined(LPUART_14)
static cmsis_lpuart_resource_t LPUART14_Resource = {LPUART_14, LPUART14_GetFreq};
#endif

#if defined(RTE_USART14_DMA_EN) && RTE_USART14_DMA_EN

#if (defined(FSL_FEATURE_SOC_DMA_COUNT) && FSL_FEATURE_SOC_DMA_COUNT)

static cmsis_lpuart_dma_resource_t LPUART14_DmaResource = {
    RTE_USART14_DMA_TX_DMA_BASE,    RTE_USART14_DMA_TX_CH,          RTE_USART14_DMA_TX_PERI_SEL,
    RTE_USART14_DMA_RX_DMA_BASE,    RTE_USART14_DMA_RX_CH,          RTE_USART14_DMA_RX_PERI_SEL,

#if (defined(FSL_FEATURE_SOC_DMAMUX_COUNT) && FSL_FEATURE_SOC_DMAMUX_COUNT)
    RTE_USART14_DMA_TX_DMAMUX_BASE, RTE_USART14_DMA_RX_DMAMUX_BASE,
#endif
#if FSL_FEATURE_DMA_MODULE_CHANNEL != FSL_FEATURE_DMAMUX_MODULE_CHANNEL
    RTE_USART14_DMAMUX_TX_CH,       RTE_USART14_DMAMUX_RX_CH
#endif
};

static lpuart_dma_handle_t LPUART14_DmaHandle;
static dma_handle_t LPUART14_DmaRxHandle;
static dma_handle_t LPUART14_DmaTxHandle;

#if defined(__CC_ARM) || defined(__ARMCC_VERSION)
ARMCC_SECTION("lpuart14_dma_driver_state")
static cmsis_lpuart_dma_driver_state_t LPUART14_DmaDriverState = {
#else
static cmsis_lpuart_dma_driver_state_t LPUART14_DmaDriverState = {
#endif
    &LPUART14_Resource, &LPUART14_DmaResource, &LPUART14_DmaHandle, &LPUART14_DmaRxHandle, &LPUART14_DmaTxHandle,
};

static int32_t LPUART14_DmaInitialize(ARM_USART_SignalEvent_t cb_event)
{
#ifdef RTE_USART14_PIN_INIT
    RTE_USART14_PIN_INIT();
#endif
    return LPUART_DmaInitialize(cb_event, &LPUART14_DmaDriverState);
}

static int32_t LPUART14_DmaUninitialize(void)
{
#ifdef RTE_USART14_PIN_DEINIT
    RTE_USART14_PIN_DEINIT();
#endif
    return LPUART_DmaUninitialize(&LPUART14_DmaDriverState);
}

static int32_t LPUART14_DmaPowerControl(ARM_POWER_STATE state)
{
    return LPUART_DmaPowerControl(state, &LPUART14_DmaDriverState);
}

static int32_t LPUART14_DmaSend(const void *data, uint32_t num)
{
    return LPUART_DmaSend(data, num, &LPUART14_DmaDriverState);
}

static int32_t LPUART14_DmaReceive(void *data, uint32_t num)
{
    return LPUART_DmaReceive(data, num, &LPUART14_DmaDriverState);
}

static int32_t LPUART14_DmaTransfer(const void *data_out, void *data_in, uint32_t num)
{
    return LPUART_DmaTransfer(data_out, data_in, num, &LPUART14_DmaDriverState);
}

static uint32_t LPUART14_DmaGetTxCount(void)
{
    return LPUART_DmaGetTxCount(&LPUART14_DmaDriverState);
}

static uint32_t LPUART14_DmaGetRxCount(void)
{
    return LPUART_DmaGetRxCount(&LPUART14_DmaDriverState);
}

static int32_t LPUART14_DmaControl(uint32_t control, uint32_t arg)
{
    return LPUART_DmaControl(control, arg, &LPUART14_DmaDriverState);
}

static ARM_USART_STATUS LPUART14_DmaGetStatus(void)
{
    return LPUART_DmaGetStatus(&LPUART14_DmaDriverState);
}

/* LPUART14 Driver Control Block */

#endif

#if (defined(FSL_FEATURE_SOC_EDMA_COUNT) && FSL_FEATURE_SOC_EDMA_COUNT)

static cmsis_lpuart_edma_resource_t LPUART14_EdmaResource = {
    RTE_USART14_DMA_TX_DMA_BASE,    RTE_USART14_DMA_TX_CH,          RTE_USART14_DMA_TX_PERI_SEL,
    RTE_USART14_DMA_RX_DMA_BASE,    RTE_USART14_DMA_RX_CH,          RTE_USART14_DMA_RX_PERI_SEL,

#if (defined(FSL_FEATURE_SOC_DMAMUX_COUNT) && FSL_FEATURE_SOC_DMAMUX_COUNT)
    RTE_USART14_DMA_TX_DMAMUX_BASE, RTE_USART14_DMA_RX_DMAMUX_BASE,
#endif
};

