vanhao-hub/usb_key_authen/src/core/mcxa156/sdks/frdm_mcxa156_sdk/devices/MCXA156/cmsis_drivers/fsl_lpuart_cmsis.c
static lpuart_edma_handle_t LPUART14_EdmaHandle;
static edma_handle_t LPUART14_EdmaRxHandle;
static edma_handle_t LPUART14_EdmaTxHandle;

#if defined(__CC_ARM) || defined(__ARMCC_VERSION)
ARMCC_SECTION("lpuart14_edma_driver_state")
static cmsis_lpuart_edma_driver_state_t LPUART14_EdmaDriverState = {
#else
static cmsis_lpuart_edma_driver_state_t LPUART14_EdmaDriverState = {
#endif
    &LPUART14_Resource, &LPUART14_EdmaResource, &LPUART14_EdmaHandle, &LPUART14_EdmaRxHandle, &LPUART14_EdmaTxHandle,
};

static int32_t LPUART14_EdmaInitialize(ARM_USART_SignalEvent_t cb_event)
{
#ifdef RTE_USART14_PIN_INIT
    RTE_USART14_PIN_INIT();
#endif
    return LPUART_EdmaInitialize(cb_event, &LPUART14_EdmaDriverState);
}

static int32_t LPUART14_EdmaUninitialize(void)
{
#ifdef RTE_USART14_PIN_DEINIT
    RTE_USART14_PIN_DEINIT();
#endif
    return LPUART_EdmaUninitialize(&LPUART14_EdmaDriverState);
}

static int32_t LPUART14_EdmaPowerControl(ARM_POWER_STATE state)
{
    return LPUART_EdmaPowerControl(state, &LPUART14_EdmaDriverState);
}

static int32_t LPUART14_EdmaSend(const void *data, uint32_t num)
{
    return LPUART_EdmaSend(data, num, &LPUART14_EdmaDriverState);
}

static int32_t LPUART14_EdmaReceive(void *data, uint32_t num)
{
    return LPUART_EdmaReceive(data, num, &LPUART14_EdmaDriverState);
}

static int32_t LPUART14_EdmaTransfer(const void *data_out, void *data_in, uint32_t num)
{
    return LPUART_EdmaTransfer(data_out, data_in, num, &LPUART14_EdmaDriverState);
}

static uint32_t LPUART14_EdmaGetTxCount(void)
{
    return LPUART_EdmaGetTxCount(&LPUART14_EdmaDriverState);
}

static uint32_t LPUART14_EdmaGetRxCount(void)
{
    return LPUART_EdmaGetRxCount(&LPUART14_EdmaDriverState);
}

static int32_t LPUART14_EdmaControl(uint32_t control, uint32_t arg)
{
    return LPUART_EdmaControl(control, arg, &LPUART14_EdmaDriverState);
}

static ARM_USART_STATUS LPUART14_EdmaGetStatus(void)
{
    return LPUART_EdmaGetStatus(&LPUART14_EdmaDriverState);
}

#endif

#else

static lpuart_handle_t LPUART14_Handle;

#if defined(USART14_RX_BUFFER_ENABLE) && (USART14_RX_BUFFER_ENABLE == 1)
static uint8_t lpuart14_rxRingBuffer[USART_RX_BUFFER_LEN];
#endif

#if defined(__CC_ARM) || defined(__ARMCC_VERSION)
ARMCC_SECTION("lpuart14_non_blocking_driver_state")
static cmsis_lpuart_non_blocking_driver_state_t LPUART14_NonBlockingDriverState = {
#else
static cmsis_lpuart_non_blocking_driver_state_t LPUART14_NonBlockingDriverState = {
#endif
    &LPUART14_Resource,
    &LPUART14_Handle,
};

static int32_t LPUART14_NonBlockingInitialize(ARM_USART_SignalEvent_t cb_event)
{
#ifdef RTE_USART14_PIN_INIT
    RTE_USART14_PIN_INIT();
#endif
    return LPUART_NonBlockingInitialize(cb_event, &LPUART14_NonBlockingDriverState);
}

static int32_t LPUART14_NonBlockingUninitialize(void)
{
#ifdef RTE_USART14_PIN_DEINIT
    RTE_USART14_PIN_DEINIT();
#endif
    return LPUART_NonBlockingUninitialize(&LPUART14_NonBlockingDriverState);
}

static int32_t LPUART14_NonBlockingPowerControl(ARM_POWER_STATE state)
{
    int32_t result;

    result = LPUART_NonBlockingPowerControl(state, &LPUART14_NonBlockingDriverState);

#if defined(USART14_RX_BUFFER_ENABLE) && (USART14_RX_BUFFER_ENABLE == 1)
    if ((state == ARM_POWER_FULL) && (LPUART14_NonBlockingDriverState.handle->rxRingBuffer == NULL))
    {
        LPUART_TransferStartRingBuffer(LPUART14_NonBlockingDriverState.resource->base,
                                       LPUART14_NonBlockingDriverState.handle, lpuart14_rxRingBuffer,
                                       USART_RX_BUFFER_LEN);
    }
#endif

    return result;
}

static int32_t LPUART14_NonBlockingSend(const void *data, uint32_t num)
{
    return LPUART_NonBlockingSend(data, num, &LPUART14_NonBlockingDriverState);
}

static int32_t LPUART14_NonBlockingReceive(void *data, uint32_t num)
{
    return LPUART_NonBlockingReceive(data, num, &LPUART14_NonBlockingDriverState);
}

static int32_t LPUART14_NonBlockingTransfer(const void *data_out, void *data_in, uint32_t num)
{
    return LPUART_NonBlockingTransfer(data_out, data_in, num, &LPUART14_NonBlockingDriverState);
}

static uint32_t LPUART14_NonBlockingGetTxCount(void)
{
    return LPUART_NonBlockingGetTxCount(&LPUART14_NonBlockingDriverState);
}

static uint32_t LPUART14_NonBlockingGetRxCount(void)
{
    return LPUART_NonBlockingGetRxCount(&LPUART14_NonBlockingDriverState);
}

static int32_t LPUART14_NonBlockingControl(uint32_t control, uint32_t arg)
{
    int32_t result;

    result = LPUART_NonBlockingControl(control, arg, &LPUART14_NonBlockingDriverState);
    if (ARM_DRIVER_OK != result)
    {
        return result;
    }

    /* Enable the receive interrupts if ring buffer is used */
    if (LPUART14_NonBlockingDriverState.handle->rxRingBuffer != NULL)
    {
        LPUART_EnableInterrupts(
            LPUART14_NonBlockingDriverState.resource->base,
            (uint32_t)kLPUART_RxDataRegFullInterruptEnable | (uint32_t)kLPUART_RxOverrunInterruptEnable);
    }

    return ARM_DRIVER_OK;
}

static ARM_USART_STATUS LPUART14_NonBlockingGetStatus(void)
{
    return LPUART_NonBlockingGetStatus(&LPUART14_NonBlockingDriverState);
}

#endif

ARM_DRIVER_USART Driver_USART14 = {LPUARTx_GetVersion,      LPUARTx_GetCapabilities,
#if defined(RTE_USART14_DMA_EN) && RTE_USART14_DMA_EN
#if (defined(FSL_FEATURE_SOC_EDMA_COUNT) && FSL_FEATURE_SOC_EDMA_COUNT)
                                   LPUART14_EdmaInitialize, LPUART14_EdmaUninitialize, LPUART14_EdmaPowerControl,
                                   LPUART14_EdmaSend,       LPUART14_EdmaReceive,      LPUART14_EdmaTransfer,
                                   LPUART14_EdmaGetTxCount, LPUART14_EdmaGetRxCount,   LPUART14_EdmaControl,
                                   LPUART14_EdmaGetStatus,
#else
                                   LPUART14_DmaInitialize,  LPUART14_DmaUninitialize, LPUART14_DmaPowerControl,
                                   LPUART14_DmaSend,        LPUART14_DmaReceive,      LPUART14_DmaTransfer,
                                   LPUART14_DmaGetTxCount,  LPUART14_DmaGetRxCount,   LPUART14_DmaControl,
                                   LPUART14_DmaGetStatus,
#endif /* FSL_FEATURE_SOC_EDMA_COUNT */
#else
                                  LPUART14_NonBlockingInitialize,
                                  LPUART14_NonBlockingUninitialize,
                                  LPUART14_NonBlockingPowerControl,
                                  LPUART14_NonBlockingSend,
                                  LPUART14_NonBlockingReceive,
                                  LPUART14_NonBlockingTransfer,
                                  LPUART14_NonBlockingGetTxCount,
                                  LPUART14_NonBlockingGetRxCount,
                                  LPUART14_NonBlockingControl,
                                  LPUART14_NonBlockingGetStatus,
#endif /* RTE_USART14_DMA_EN */
                                   LPUARTx_SetModemControl, LPUARTx_GetModemStatus};

#endif /* LPUART14 */

