vanhao-hub/usb_key_authen/src/core/mcxa156/sdks/frdm_mcxa156_sdk/devices/MCXA156/cmsis_drivers/fsl_lpuart_cmsis.c
static int32_t LPUART15_NonBlockingUninitialize(void)
{
#ifdef RTE_USART15_PIN_DEINIT
    RTE_USART15_PIN_DEINIT();
#endif
    return LPUART_NonBlockingUninitialize(&LPUART15_NonBlockingDriverState);
}

static int32_t LPUART15_NonBlockingPowerControl(ARM_POWER_STATE state)
{
    int32_t result;

    result = LPUART_NonBlockingPowerControl(state, &LPUART15_NonBlockingDriverState);

#if defined(USART15_RX_BUFFER_ENABLE) && (USART15_RX_BUFFER_ENABLE == 1)
    if ((state == ARM_POWER_FULL) && (LPUART15_NonBlockingDriverState.handle->rxRingBuffer == NULL))
    {
        LPUART_TransferStartRingBuffer(LPUART15_NonBlockingDriverState.resource->base,
                                       LPUART15_NonBlockingDriverState.handle, lpuart15_rxRingBuffer,
                                       USART_RX_BUFFER_LEN);
    }
#endif

    return result;
}

static int32_t LPUART15_NonBlockingSend(const void *data, uint32_t num)
{
    return LPUART_NonBlockingSend(data, num, &LPUART15_NonBlockingDriverState);
}

static int32_t LPUART15_NonBlockingReceive(void *data, uint32_t num)
{
    return LPUART_NonBlockingReceive(data, num, &LPUART15_NonBlockingDriverState);
}

static int32_t LPUART15_NonBlockingTransfer(const void *data_out, void *data_in, uint32_t num)
{
    return LPUART_NonBlockingTransfer(data_out, data_in, num, &LPUART15_NonBlockingDriverState);
}

static uint32_t LPUART15_NonBlockingGetTxCount(void)
{
    return LPUART_NonBlockingGetTxCount(&LPUART15_NonBlockingDriverState);
}

static uint32_t LPUART15_NonBlockingGetRxCount(void)
{
    return LPUART_NonBlockingGetRxCount(&LPUART15_NonBlockingDriverState);
}

static int32_t LPUART15_NonBlockingControl(uint32_t control, uint32_t arg)
{
    int32_t result;

    result = LPUART_NonBlockingControl(control, arg, &LPUART15_NonBlockingDriverState);
    if (ARM_DRIVER_OK != result)
    {
        return result;
    }

    /* Enable the receive interrupts if ring buffer is used */
    if (LPUART15_NonBlockingDriverState.handle->rxRingBuffer != NULL)
    {
        LPUART_EnableInterrupts(
            LPUART15_NonBlockingDriverState.resource->base,
            (uint32_t)kLPUART_RxDataRegFullInterruptEnable | (uint32_t)kLPUART_RxOverrunInterruptEnable);
    }

    return ARM_DRIVER_OK;
}

static ARM_USART_STATUS LPUART15_NonBlockingGetStatus(void)
{
    return LPUART_NonBlockingGetStatus(&LPUART15_NonBlockingDriverState);
}

#endif

ARM_DRIVER_USART Driver_USART15 = {LPUARTx_GetVersion,      LPUARTx_GetCapabilities,
#if defined(RTE_USART15_DMA_EN) && RTE_USART15_DMA_EN
#if (defined(FSL_FEATURE_SOC_EDMA_COUNT) && FSL_FEATURE_SOC_EDMA_COUNT)
                                   LPUART15_EdmaInitialize, LPUART15_EdmaUninitialize, LPUART15_EdmaPowerControl,
                                   LPUART15_EdmaSend,       LPUART15_EdmaReceive,      LPUART15_EdmaTransfer,
                                   LPUART15_EdmaGetTxCount, LPUART15_EdmaGetRxCount,   LPUART15_EdmaControl,
                                   LPUART15_EdmaGetStatus,
#else
                                   LPUART15_DmaInitialize,  LPUART15_DmaUninitialize, LPUART15_DmaPowerControl,
                                   LPUART15_DmaSend,        LPUART15_DmaReceive,      LPUART15_DmaTransfer,
                                   LPUART15_DmaGetTxCount,  LPUART15_DmaGetRxCount,   LPUART15_DmaControl,
                                   LPUART15_DmaGetStatus,
#endif /* FSL_FEATURE_SOC_EDMA_COUNT */
#else
                                  LPUART15_NonBlockingInitialize,
                                  LPUART15_NonBlockingUninitialize,
                                  LPUART15_NonBlockingPowerControl,
                                  LPUART15_NonBlockingSend,
                                  LPUART15_NonBlockingReceive,
                                  LPUART15_NonBlockingTransfer,
                                  LPUART15_NonBlockingGetTxCount,
                                  LPUART15_NonBlockingGetRxCount,
                                  LPUART15_NonBlockingControl,
                                  LPUART15_NonBlockingGetStatus,
#endif /* RTE_USART15_DMA_EN */
                                   LPUARTx_SetModemControl, LPUARTx_GetModemStatus};

#endif /* LPUART15 */

#if (defined(LPUART16) || defined(LPUART_16)) && defined(RTE_USART16) && RTE_USART16

/* User needs to provide the implementation for LPUART16_GetFreq/InitPins/DeinitPins
in the application for enabling according instance. */
extern uint32_t LPUART16_GetFreq(void);

#if defined(LPUART16)
static cmsis_lpuart_resource_t LPUART16_Resource = {LPUART16, LPUART16_GetFreq};
#elif defined(LPUART_16)
static cmsis_lpuart_resource_t LPUART16_Resource = {LPUART_16, LPUART16_GetFreq};
#endif

#if defined(RTE_USART16_DMA_EN) && RTE_USART16_DMA_EN

#if (defined(FSL_FEATURE_SOC_DMA_COUNT) && FSL_FEATURE_SOC_DMA_COUNT)

static cmsis_lpuart_dma_resource_t LPUART16_DmaResource = {
    RTE_USART16_DMA_TX_DMA_BASE,    RTE_USART16_DMA_TX_CH,          RTE_USART16_DMA_TX_PERI_SEL,
    RTE_USART16_DMA_RX_DMA_BASE,    RTE_USART16_DMA_RX_CH,          RTE_USART16_DMA_RX_PERI_SEL,

#if (defined(FSL_FEATURE_SOC_DMAMUX_COUNT) && FSL_FEATURE_SOC_DMAMUX_COUNT)
    RTE_USART16_DMA_TX_DMAMUX_BASE, RTE_USART16_DMA_RX_DMAMUX_BASE,
#endif
#if FSL_FEATURE_DMA_MODULE_CHANNEL != FSL_FEATURE_DMAMUX_MODULE_CHANNEL
    RTE_USART16_DMAMUX_TX_CH,       RTE_USART16_DMAMUX_RX_CH
#endif
};

static lpuart_dma_handle_t LPUART16_DmaHandle;
static dma_handle_t LPUART16_DmaRxHandle;
static dma_handle_t LPUART16_DmaTxHandle;

#if defined(__CC_ARM) || defined(__ARMCC_VERSION)
ARMCC_SECTION("lpuart16_dma_driver_state")
static cmsis_lpuart_dma_driver_state_t LPUART16_DmaDriverState = {
#else
static cmsis_lpuart_dma_driver_state_t LPUART16_DmaDriverState = {
#endif
    &LPUART16_Resource, &LPUART16_DmaResource, &LPUART16_DmaHandle, &LPUART16_DmaRxHandle, &LPUART16_DmaTxHandle,
};

