vanhao-hub/usb_key_authen/src/core/mcxa156/sdks/frdm_mcxa156_sdk/devices/MCXA156/cmsis_drivers/fsl_lpuart_cmsis.c
static int32_t LPUART16_DmaInitialize(ARM_USART_SignalEvent_t cb_event)
{
#ifdef RTE_USART16_PIN_INIT
    RTE_USART16_PIN_INIT();
#endif
    return LPUART_DmaInitialize(cb_event, &LPUART16_DmaDriverState);
}

static int32_t LPUART16_DmaUninitialize(void)
{
#ifdef RTE_USART16_PIN_DEINIT
    RTE_USART16_PIN_DEINIT();
#endif
    return LPUART_DmaUninitialize(&LPUART16_DmaDriverState);
}

static int32_t LPUART16_DmaPowerControl(ARM_POWER_STATE state)
{
    return LPUART_DmaPowerControl(state, &LPUART16_DmaDriverState);
}

static int32_t LPUART16_DmaSend(const void *data, uint32_t num)
{
    return LPUART_DmaSend(data, num, &LPUART16_DmaDriverState);
}

static int32_t LPUART16_DmaReceive(void *data, uint32_t num)
{
    return LPUART_DmaReceive(data, num, &LPUART16_DmaDriverState);
}

static int32_t LPUART16_DmaTransfer(const void *data_out, void *data_in, uint32_t num)
{
    return LPUART_DmaTransfer(data_out, data_in, num, &LPUART16_DmaDriverState);
}

static uint32_t LPUART16_DmaGetTxCount(void)
{
    return LPUART_DmaGetTxCount(&LPUART16_DmaDriverState);
}

static uint32_t LPUART16_DmaGetRxCount(void)
{
    return LPUART_DmaGetRxCount(&LPUART16_DmaDriverState);
}

static int32_t LPUART16_DmaControl(uint32_t control, uint32_t arg)
{
    return LPUART_DmaControl(control, arg, &LPUART16_DmaDriverState);
}

static ARM_USART_STATUS LPUART16_DmaGetStatus(void)
{
    return LPUART_DmaGetStatus(&LPUART16_DmaDriverState);
}

/* LPUART16 Driver Control Block */

#endif

#if (defined(FSL_FEATURE_SOC_EDMA_COUNT) && FSL_FEATURE_SOC_EDMA_COUNT)

static cmsis_lpuart_edma_resource_t LPUART16_EdmaResource = {
    RTE_USART16_DMA_TX_DMA_BASE,    RTE_USART16_DMA_TX_CH,          RTE_USART16_DMA_TX_PERI_SEL,
    RTE_USART16_DMA_RX_DMA_BASE,    RTE_USART16_DMA_RX_CH,          RTE_USART16_DMA_RX_PERI_SEL,

#if (defined(FSL_FEATURE_SOC_DMAMUX_COUNT) && FSL_FEATURE_SOC_DMAMUX_COUNT)
    RTE_USART16_DMA_TX_DMAMUX_BASE, RTE_USART16_DMA_RX_DMAMUX_BASE,
#endif
};

static lpuart_edma_handle_t LPUART16_EdmaHandle;
static edma_handle_t LPUART16_EdmaRxHandle;
static edma_handle_t LPUART16_EdmaTxHandle;

#if defined(__CC_ARM) || defined(__ARMCC_VERSION)
ARMCC_SECTION("lpuart16_edma_driver_state")
static cmsis_lpuart_edma_driver_state_t LPUART16_EdmaDriverState = {
#else
static cmsis_lpuart_edma_driver_state_t LPUART16_EdmaDriverState = {
#endif
    &LPUART16_Resource, &LPUART16_EdmaResource, &LPUART16_EdmaHandle, &LPUART16_EdmaRxHandle, &LPUART16_EdmaTxHandle,
};

static int32_t LPUART16_EdmaInitialize(ARM_USART_SignalEvent_t cb_event)
{
#ifdef RTE_USART16_PIN_INIT
    RTE_USART16_PIN_INIT();
#endif
    return LPUART_EdmaInitialize(cb_event, &LPUART16_EdmaDriverState);
}

static int32_t LPUART16_EdmaUninitialize(void)
{
#ifdef RTE_USART16_PIN_DEINIT
    RTE_USART16_PIN_DEINIT();
#endif
    return LPUART_EdmaUninitialize(&LPUART16_EdmaDriverState);
}

static int32_t LPUART16_EdmaPowerControl(ARM_POWER_STATE state)
{
    return LPUART_EdmaPowerControl(state, &LPUART16_EdmaDriverState);
}

static int32_t LPUART16_EdmaSend(const void *data, uint32_t num)
{
    return LPUART_EdmaSend(data, num, &LPUART16_EdmaDriverState);
}

static int32_t LPUART16_EdmaReceive(void *data, uint32_t num)
{
    return LPUART_EdmaReceive(data, num, &LPUART16_EdmaDriverState);
}

static int32_t LPUART16_EdmaTransfer(const void *data_out, void *data_in, uint32_t num)
{
    return LPUART_EdmaTransfer(data_out, data_in, num, &LPUART16_EdmaDriverState);
}

static uint32_t LPUART16_EdmaGetTxCount(void)
{
    return LPUART_EdmaGetTxCount(&LPUART16_EdmaDriverState);
}

static uint32_t LPUART16_EdmaGetRxCount(void)
{
    return LPUART_EdmaGetRxCount(&LPUART16_EdmaDriverState);
}

static int32_t LPUART16_EdmaControl(uint32_t control, uint32_t arg)
{
    return LPUART_EdmaControl(control, arg, &LPUART16_EdmaDriverState);
}

static ARM_USART_STATUS LPUART16_EdmaGetStatus(void)
{
    return LPUART_EdmaGetStatus(&LPUART16_EdmaDriverState);
}

#endif

#else

static lpuart_handle_t LPUART16_Handle;

#if defined(USART16_RX_BUFFER_ENABLE) && (USART16_RX_BUFFER_ENABLE == 1)
static uint8_t lpuart16_rxRingBuffer[USART_RX_BUFFER_LEN];
#endif

#if defined(__CC_ARM) || defined(__ARMCC_VERSION)
ARMCC_SECTION("lpuart16_non_blocking_driver_state")
static cmsis_lpuart_non_blocking_driver_state_t LPUART16_NonBlockingDriverState = {
#else
static cmsis_lpuart_non_blocking_driver_state_t LPUART16_NonBlockingDriverState = {
#endif
    &LPUART16_Resource,
    &LPUART16_Handle,
};

static int32_t LPUART16_NonBlockingInitialize(ARM_USART_SignalEvent_t cb_event)
{
#ifdef RTE_USART16_PIN_INIT
    RTE_USART16_PIN_INIT();
#endif
    return LPUART_NonBlockingInitialize(cb_event, &LPUART16_NonBlockingDriverState);
}

static int32_t LPUART16_NonBlockingUninitialize(void)
{
#ifdef RTE_USART16_PIN_DEINIT
    RTE_USART16_PIN_DEINIT();
#endif
    return LPUART_NonBlockingUninitialize(&LPUART16_NonBlockingDriverState);
}

static int32_t LPUART16_NonBlockingPowerControl(ARM_POWER_STATE state)
{
    int32_t result;

    result = LPUART_NonBlockingPowerControl(state, &LPUART16_NonBlockingDriverState);

#if defined(USART16_RX_BUFFER_ENABLE) && (USART16_RX_BUFFER_ENABLE == 1)
    if ((state == ARM_POWER_FULL) && (LPUART16_NonBlockingDriverState.handle->rxRingBuffer == NULL))
    {
        LPUART_TransferStartRingBuffer(LPUART16_NonBlockingDriverState.resource->base,
                                       LPUART16_NonBlockingDriverState.handle, lpuart16_rxRingBuffer,
                                       USART_RX_BUFFER_LEN);
    }
#endif

    return result;
}

static int32_t LPUART16_NonBlockingSend(const void *data, uint32_t num)
{
    return LPUART_NonBlockingSend(data, num, &LPUART16_NonBlockingDriverState);
}

static int32_t LPUART16_NonBlockingReceive(void *data, uint32_t num)
{
    return LPUART_NonBlockingReceive(data, num, &LPUART16_NonBlockingDriverState);
}

static int32_t LPUART16_NonBlockingTransfer(const void *data_out, void *data_in, uint32_t num)
{
    return LPUART_NonBlockingTransfer(data_out, data_in, num, &LPUART16_NonBlockingDriverState);
}

static uint32_t LPUART16_NonBlockingGetTxCount(void)
{
    return LPUART_NonBlockingGetTxCount(&LPUART16_NonBlockingDriverState);
}

static uint32_t LPUART16_NonBlockingGetRxCount(void)
{
    return LPUART_NonBlockingGetRxCount(&LPUART16_NonBlockingDriverState);
}

