vanhao-hub/usb_key_authen/src/core/mcxa156/sdks/frdm_mcxa156_sdk/devices/MCXA156/cmsis_drivers/fsl_lpuart_cmsis.c
static int32_t LPUART16_NonBlockingControl(uint32_t control, uint32_t arg)
{
    int32_t result;

    result = LPUART_NonBlockingControl(control, arg, &LPUART16_NonBlockingDriverState);
    if (ARM_DRIVER_OK != result)
    {
        return result;
    }

    /* Enable the receive interrupts if ring buffer is used */
    if (LPUART16_NonBlockingDriverState.handle->rxRingBuffer != NULL)
    {
        LPUART_EnableInterrupts(
            LPUART16_NonBlockingDriverState.resource->base,
            (uint32_t)kLPUART_RxDataRegFullInterruptEnable | (uint32_t)kLPUART_RxOverrunInterruptEnable);
    }

    return ARM_DRIVER_OK;
}

static ARM_USART_STATUS LPUART16_NonBlockingGetStatus(void)
{
    return LPUART_NonBlockingGetStatus(&LPUART16_NonBlockingDriverState);
}

#endif

ARM_DRIVER_USART Driver_USART16 = {LPUARTx_GetVersion,      LPUARTx_GetCapabilities,
#if defined(RTE_USART16_DMA_EN) && RTE_USART16_DMA_EN
#if (defined(FSL_FEATURE_SOC_EDMA_COUNT) && FSL_FEATURE_SOC_EDMA_COUNT)
                                   LPUART16_EdmaInitialize, LPUART16_EdmaUninitialize, LPUART16_EdmaPowerControl,
                                   LPUART16_EdmaSend,       LPUART16_EdmaReceive,      LPUART16_EdmaTransfer,
                                   LPUART16_EdmaGetTxCount, LPUART16_EdmaGetRxCount,   LPUART16_EdmaControl,
                                   LPUART16_EdmaGetStatus,
#else
                                   LPUART16_DmaInitialize,  LPUART16_DmaUninitialize, LPUART16_DmaPowerControl,
                                   LPUART16_DmaSend,        LPUART16_DmaReceive,      LPUART16_DmaTransfer,
                                   LPUART16_DmaGetTxCount,  LPUART16_DmaGetRxCount,   LPUART16_DmaControl,
                                   LPUART16_DmaGetStatus,
#endif /* FSL_FEATURE_SOC_EDMA_COUNT */
#else
                                  LPUART16_NonBlockingInitialize,
                                  LPUART16_NonBlockingUninitialize,
                                  LPUART16_NonBlockingPowerControl,
                                  LPUART16_NonBlockingSend,
                                  LPUART16_NonBlockingReceive,
                                  LPUART16_NonBlockingTransfer,
                                  LPUART16_NonBlockingGetTxCount,
                                  LPUART16_NonBlockingGetRxCount,
                                  LPUART16_NonBlockingControl,
                                  LPUART16_NonBlockingGetStatus,
#endif /* RTE_USART16_DMA_EN */
                                   LPUARTx_SetModemControl, LPUARTx_GetModemStatus};

#endif /* LPUART16 */

#if (defined(LPUART17) || defined(LPUART_17)) && defined(RTE_USART17) && RTE_USART17

/* User needs to provide the implementation for LPUART17_GetFreq/InitPins/DeinitPins
in the application for enabling according instance. */
extern uint32_t LPUART17_GetFreq(void);

#if defined(LPUART17)
static cmsis_lpuart_resource_t LPUART17_Resource = {LPUART17, LPUART17_GetFreq};
#elif defined(LPUART_17)
static cmsis_lpuart_resource_t LPUART17_Resource = {LPUART_17, LPUART17_GetFreq};
#endif

#if defined(RTE_USART17_DMA_EN) && RTE_USART17_DMA_EN

#if (defined(FSL_FEATURE_SOC_DMA_COUNT) && FSL_FEATURE_SOC_DMA_COUNT)

static cmsis_lpuart_dma_resource_t LPUART17_DmaResource = {
    RTE_USART17_DMA_TX_DMA_BASE,    RTE_USART17_DMA_TX_CH,          RTE_USART17_DMA_TX_PERI_SEL,
    RTE_USART17_DMA_RX_DMA_BASE,    RTE_USART17_DMA_RX_CH,          RTE_USART17_DMA_RX_PERI_SEL,

#if (defined(FSL_FEATURE_SOC_DMAMUX_COUNT) && FSL_FEATURE_SOC_DMAMUX_COUNT)
    RTE_USART17_DMA_TX_DMAMUX_BASE, RTE_USART17_DMA_RX_DMAMUX_BASE,
#endif
#if FSL_FEATURE_DMA_MODULE_CHANNEL != FSL_FEATURE_DMAMUX_MODULE_CHANNEL
    RTE_USART17_DMAMUX_TX_CH,       RTE_USART17_DMAMUX_RX_CH
#endif
};

static lpuart_dma_handle_t LPUART17_DmaHandle;
static dma_handle_t LPUART17_DmaRxHandle;
static dma_handle_t LPUART17_DmaTxHandle;

#if defined(__CC_ARM) || defined(__ARMCC_VERSION)
ARMCC_SECTION("lpuart17_dma_driver_state")
static cmsis_lpuart_dma_driver_state_t LPUART17_DmaDriverState = {
#else
static cmsis_lpuart_dma_driver_state_t LPUART17_DmaDriverState = {
#endif
    &LPUART17_Resource, &LPUART17_DmaResource, &LPUART17_DmaHandle, &LPUART17_DmaRxHandle, &LPUART17_DmaTxHandle,
};

static int32_t LPUART17_DmaInitialize(ARM_USART_SignalEvent_t cb_event)
{
#ifdef RTE_USART17_PIN_INIT
    RTE_USART17_PIN_INIT();
#endif
    return LPUART_DmaInitialize(cb_event, &LPUART17_DmaDriverState);
}

static int32_t LPUART17_DmaUninitialize(void)
{
#ifdef RTE_USART17_PIN_DEINIT
    RTE_USART17_PIN_DEINIT();
#endif
    return LPUART_DmaUninitialize(&LPUART17_DmaDriverState);
}

static int32_t LPUART17_DmaPowerControl(ARM_POWER_STATE state)
{
    return LPUART_DmaPowerControl(state, &LPUART17_DmaDriverState);
}

static int32_t LPUART17_DmaSend(const void *data, uint32_t num)
{
    return LPUART_DmaSend(data, num, &LPUART17_DmaDriverState);
}

static int32_t LPUART17_DmaReceive(void *data, uint32_t num)
{
    return LPUART_DmaReceive(data, num, &LPUART17_DmaDriverState);
}

static int32_t LPUART17_DmaTransfer(const void *data_out, void *data_in, uint32_t num)
{
    return LPUART_DmaTransfer(data_out, data_in, num, &LPUART17_DmaDriverState);
}

static uint32_t LPUART17_DmaGetTxCount(void)
{
    return LPUART_DmaGetTxCount(&LPUART17_DmaDriverState);
}

static uint32_t LPUART17_DmaGetRxCount(void)
{
    return LPUART_DmaGetRxCount(&LPUART17_DmaDriverState);
}

static int32_t LPUART17_DmaControl(uint32_t control, uint32_t arg)
{
    return LPUART_DmaControl(control, arg, &LPUART17_DmaDriverState);
}

static ARM_USART_STATUS LPUART17_DmaGetStatus(void)
{
    return LPUART_DmaGetStatus(&LPUART17_DmaDriverState);
}

/* LPUART17 Driver Control Block */

#endif

#if (defined(FSL_FEATURE_SOC_EDMA_COUNT) && FSL_FEATURE_SOC_EDMA_COUNT)

static cmsis_lpuart_edma_resource_t LPUART17_EdmaResource = {
    RTE_USART17_DMA_TX_DMA_BASE,    RTE_USART17_DMA_TX_CH,          RTE_USART17_DMA_TX_PERI_SEL,
    RTE_USART17_DMA_RX_DMA_BASE,    RTE_USART17_DMA_RX_CH,          RTE_USART17_DMA_RX_PERI_SEL,

#if (defined(FSL_FEATURE_SOC_DMAMUX_COUNT) && FSL_FEATURE_SOC_DMAMUX_COUNT)
    RTE_USART17_DMA_TX_DMAMUX_BASE, RTE_USART17_DMA_RX_DMAMUX_BASE,
#endif
};

static lpuart_edma_handle_t LPUART17_EdmaHandle;
static edma_handle_t LPUART17_EdmaRxHandle;
static edma_handle_t LPUART17_EdmaTxHandle;

