vanhao-hub/usb_key_authen/src/core/mcxa156/sdks/frdm_mcxa156_sdk/devices/MCXA156/cmsis_drivers/fsl_lpuart_cmsis.c
#if defined(LPUART18)
static cmsis_lpuart_resource_t LPUART18_Resource = {LPUART18, LPUART18_GetFreq};
#elif defined(LPUART_18)
static cmsis_lpuart_resource_t LPUART18_Resource = {LPUART_18, LPUART18_GetFreq};
#endif

#if defined(RTE_USART18_DMA_EN) && RTE_USART18_DMA_EN

#if (defined(FSL_FEATURE_SOC_DMA_COUNT) && FSL_FEATURE_SOC_DMA_COUNT)

static cmsis_lpuart_dma_resource_t LPUART18_DmaResource = {
    RTE_USART18_DMA_TX_DMA_BASE,    RTE_USART18_DMA_TX_CH,          RTE_USART18_DMA_TX_PERI_SEL,
    RTE_USART18_DMA_RX_DMA_BASE,    RTE_USART18_DMA_RX_CH,          RTE_USART18_DMA_RX_PERI_SEL,

#if (defined(FSL_FEATURE_SOC_DMAMUX_COUNT) && FSL_FEATURE_SOC_DMAMUX_COUNT)
    RTE_USART18_DMA_TX_DMAMUX_BASE, RTE_USART18_DMA_RX_DMAMUX_BASE,
#endif
#if FSL_FEATURE_DMA_MODULE_CHANNEL != FSL_FEATURE_DMAMUX_MODULE_CHANNEL
    RTE_USART18_DMAMUX_TX_CH,       RTE_USART18_DMAMUX_RX_CH
#endif
};

static lpuart_dma_handle_t LPUART18_DmaHandle;
static dma_handle_t LPUART18_DmaRxHandle;
static dma_handle_t LPUART18_DmaTxHandle;

#if defined(__CC_ARM) || defined(__ARMCC_VERSION)
ARMCC_SECTION("lpuart18_dma_driver_state")
static cmsis_lpuart_dma_driver_state_t LPUART18_DmaDriverState = {
#else
static cmsis_lpuart_dma_driver_state_t LPUART18_DmaDriverState = {
#endif
    &LPUART18_Resource, &LPUART18_DmaResource, &LPUART18_DmaHandle, &LPUART18_DmaRxHandle, &LPUART18_DmaTxHandle,
};

static int32_t LPUART18_DmaInitialize(ARM_USART_SignalEvent_t cb_event)
{
#ifdef RTE_USART18_PIN_INIT
    RTE_USART18_PIN_INIT();
#endif
    return LPUART_DmaInitialize(cb_event, &LPUART18_DmaDriverState);
}

static int32_t LPUART18_DmaUninitialize(void)
{
#ifdef RTE_USART18_PIN_DEINIT
    RTE_USART18_PIN_DEINIT();
#endif
    return LPUART_DmaUninitialize(&LPUART18_DmaDriverState);
}

static int32_t LPUART18_DmaPowerControl(ARM_POWER_STATE state)
{
    return LPUART_DmaPowerControl(state, &LPUART18_DmaDriverState);
}

static int32_t LPUART18_DmaSend(const void *data, uint32_t num)
{
    return LPUART_DmaSend(data, num, &LPUART18_DmaDriverState);
}

static int32_t LPUART18_DmaReceive(void *data, uint32_t num)
{
    return LPUART_DmaReceive(data, num, &LPUART18_DmaDriverState);
}

static int32_t LPUART18_DmaTransfer(const void *data_out, void *data_in, uint32_t num)
{
    return LPUART_DmaTransfer(data_out, data_in, num, &LPUART18_DmaDriverState);
}

static uint32_t LPUART18_DmaGetTxCount(void)
{
    return LPUART_DmaGetTxCount(&LPUART18_DmaDriverState);
}

static uint32_t LPUART18_DmaGetRxCount(void)
{
    return LPUART_DmaGetRxCount(&LPUART18_DmaDriverState);
}

static int32_t LPUART18_DmaControl(uint32_t control, uint32_t arg)
{
    return LPUART_DmaControl(control, arg, &LPUART18_DmaDriverState);
}

static ARM_USART_STATUS LPUART18_DmaGetStatus(void)
{
    return LPUART_DmaGetStatus(&LPUART18_DmaDriverState);
}

/* LPUART18 Driver Control Block */

#endif

#if (defined(FSL_FEATURE_SOC_EDMA_COUNT) && FSL_FEATURE_SOC_EDMA_COUNT)

static cmsis_lpuart_edma_resource_t LPUART18_EdmaResource = {
    RTE_USART18_DMA_TX_DMA_BASE,    RTE_USART18_DMA_TX_CH,          RTE_USART18_DMA_TX_PERI_SEL,
    RTE_USART18_DMA_RX_DMA_BASE,    RTE_USART18_DMA_RX_CH,          RTE_USART18_DMA_RX_PERI_SEL,

#if (defined(FSL_FEATURE_SOC_DMAMUX_COUNT) && FSL_FEATURE_SOC_DMAMUX_COUNT)
    RTE_USART18_DMA_TX_DMAMUX_BASE, RTE_USART18_DMA_RX_DMAMUX_BASE,
#endif
};

static lpuart_edma_handle_t LPUART18_EdmaHandle;
static edma_handle_t LPUART18_EdmaRxHandle;
static edma_handle_t LPUART18_EdmaTxHandle;

#if defined(__CC_ARM) || defined(__ARMCC_VERSION)
ARMCC_SECTION("lpuart18_edma_driver_state")
static cmsis_lpuart_edma_driver_state_t LPUART18_EdmaDriverState = {
#else
static cmsis_lpuart_edma_driver_state_t LPUART18_EdmaDriverState = {
#endif
    &LPUART18_Resource, &LPUART18_EdmaResource, &LPUART18_EdmaHandle, &LPUART18_EdmaRxHandle, &LPUART18_EdmaTxHandle,
};

static int32_t LPUART18_EdmaInitialize(ARM_USART_SignalEvent_t cb_event)
{
#ifdef RTE_USART18_PIN_INIT
    RTE_USART18_PIN_INIT();
#endif
    return LPUART_EdmaInitialize(cb_event, &LPUART18_EdmaDriverState);
}

static int32_t LPUART18_EdmaUninitialize(void)
{
#ifdef RTE_USART18_PIN_DEINIT
    RTE_USART18_PIN_DEINIT();
#endif
    return LPUART_EdmaUninitialize(&LPUART18_EdmaDriverState);
}

static int32_t LPUART18_EdmaPowerControl(ARM_POWER_STATE state)
{
    return LPUART_EdmaPowerControl(state, &LPUART18_EdmaDriverState);
}

static int32_t LPUART18_EdmaSend(const void *data, uint32_t num)
{
    return LPUART_EdmaSend(data, num, &LPUART18_EdmaDriverState);
}

static int32_t LPUART18_EdmaReceive(void *data, uint32_t num)
{
    return LPUART_EdmaReceive(data, num, &LPUART18_EdmaDriverState);
}

static int32_t LPUART18_EdmaTransfer(const void *data_out, void *data_in, uint32_t num)
{
    return LPUART_EdmaTransfer(data_out, data_in, num, &LPUART18_EdmaDriverState);
}

static uint32_t LPUART18_EdmaGetTxCount(void)
{
    return LPUART_EdmaGetTxCount(&LPUART18_EdmaDriverState);
}

static uint32_t LPUART18_EdmaGetRxCount(void)
{
    return LPUART_EdmaGetRxCount(&LPUART18_EdmaDriverState);
}

static int32_t LPUART18_EdmaControl(uint32_t control, uint32_t arg)
{
    return LPUART_EdmaControl(control, arg, &LPUART18_EdmaDriverState);
}

static ARM_USART_STATUS LPUART18_EdmaGetStatus(void)
{
    return LPUART_EdmaGetStatus(&LPUART18_EdmaDriverState);
}

#endif

#else

static lpuart_handle_t LPUART18_Handle;

#if defined(USART18_RX_BUFFER_ENABLE) && (USART18_RX_BUFFER_ENABLE == 1)
static uint8_t lpuart18_rxRingBuffer[USART_RX_BUFFER_LEN];
#endif

#if defined(__CC_ARM) || defined(__ARMCC_VERSION)
ARMCC_SECTION("lpuart18_non_blocking_driver_state")
static cmsis_lpuart_non_blocking_driver_state_t LPUART18_NonBlockingDriverState = {
#else
static cmsis_lpuart_non_blocking_driver_state_t LPUART18_NonBlockingDriverState = {
#endif
    &LPUART18_Resource,
    &LPUART18_Handle,
};

static int32_t LPUART18_NonBlockingInitialize(ARM_USART_SignalEvent_t cb_event)
{
#ifdef RTE_USART18_PIN_INIT
    RTE_USART18_PIN_INIT();
#endif
    return LPUART_NonBlockingInitialize(cb_event, &LPUART18_NonBlockingDriverState);
}

static int32_t LPUART18_NonBlockingUninitialize(void)
{
#ifdef RTE_USART18_PIN_DEINIT
    RTE_USART18_PIN_DEINIT();
#endif
    return LPUART_NonBlockingUninitialize(&LPUART18_NonBlockingDriverState);
}

