vanhao-hub/usb_key_authen/src/core/mcxa156/sdks/frdm_mcxa156_sdk/devices/MCXA156/cmsis_drivers/fsl_lpuart_cmsis.c
#if defined(__CC_ARM) || defined(__ARMCC_VERSION)
ARMCC_SECTION("lpuart20_edma_driver_state")
static cmsis_lpuart_edma_driver_state_t LPUART20_EdmaDriverState = {
#else
static cmsis_lpuart_edma_driver_state_t LPUART20_EdmaDriverState = {
#endif
    &LPUART20_Resource, &LPUART20_EdmaResource, &LPUART20_EdmaHandle, &LPUART20_EdmaRxHandle, &LPUART20_EdmaTxHandle,
};

static int32_t LPUART20_EdmaInitialize(ARM_USART_SignalEvent_t cb_event)
{
#ifdef RTE_USART20_PIN_INIT
    RTE_USART20_PIN_INIT();
#endif
    return LPUART_EdmaInitialize(cb_event, &LPUART20_EdmaDriverState);
}

static int32_t LPUART20_EdmaUninitialize(void)
{
#ifdef RTE_USART20_PIN_DEINIT
    RTE_USART20_PIN_DEINIT();
#endif
    return LPUART_EdmaUninitialize(&LPUART20_EdmaDriverState);
}

static int32_t LPUART20_EdmaPowerControl(ARM_POWER_STATE state)
{
    return LPUART_EdmaPowerControl(state, &LPUART20_EdmaDriverState);
}

static int32_t LPUART20_EdmaSend(const void *data, uint32_t num)
{
    return LPUART_EdmaSend(data, num, &LPUART20_EdmaDriverState);
}

static int32_t LPUART20_EdmaReceive(void *data, uint32_t num)
{
    return LPUART_EdmaReceive(data, num, &LPUART20_EdmaDriverState);
}

static int32_t LPUART20_EdmaTransfer(const void *data_out, void *data_in, uint32_t num)
{
    return LPUART_EdmaTransfer(data_out, data_in, num, &LPUART20_EdmaDriverState);
}

static uint32_t LPUART20_EdmaGetTxCount(void)
{
    return LPUART_EdmaGetTxCount(&LPUART20_EdmaDriverState);
}

static uint32_t LPUART20_EdmaGetRxCount(void)
{
    return LPUART_EdmaGetRxCount(&LPUART20_EdmaDriverState);
}

static int32_t LPUART20_EdmaControl(uint32_t control, uint32_t arg)
{
    return LPUART_EdmaControl(control, arg, &LPUART20_EdmaDriverState);
}

static ARM_USART_STATUS LPUART20_EdmaGetStatus(void)
{
    return LPUART_EdmaGetStatus(&LPUART20_EdmaDriverState);
}

#endif

#else

static lpuart_handle_t LPUART20_Handle;

#if defined(USART20_RX_BUFFER_ENABLE) && (USART20_RX_BUFFER_ENABLE == 1)
static uint8_t lpuart20_rxRingBuffer[USART_RX_BUFFER_LEN];
#endif

#if defined(__CC_ARM) || defined(__ARMCC_VERSION)
ARMCC_SECTION("lpuart20_non_blocking_driver_state")
static cmsis_lpuart_non_blocking_driver_state_t LPUART20_NonBlockingDriverState = {
#else
static cmsis_lpuart_non_blocking_driver_state_t LPUART20_NonBlockingDriverState = {
#endif
    &LPUART20_Resource,
    &LPUART20_Handle,
};

static int32_t LPUART20_NonBlockingInitialize(ARM_USART_SignalEvent_t cb_event)
{
#ifdef RTE_USART20_PIN_INIT
    RTE_USART20_PIN_INIT();
#endif
    return LPUART_NonBlockingInitialize(cb_event, &LPUART20_NonBlockingDriverState);
}

static int32_t LPUART20_NonBlockingUninitialize(void)
{
#ifdef RTE_USART20_PIN_DEINIT
    RTE_USART20_PIN_DEINIT();
#endif
    return LPUART_NonBlockingUninitialize(&LPUART20_NonBlockingDriverState);
}

static int32_t LPUART20_NonBlockingPowerControl(ARM_POWER_STATE state)
{
    int32_t result;

    result = LPUART_NonBlockingPowerControl(state, &LPUART20_NonBlockingDriverState);

#if defined(USART20_RX_BUFFER_ENABLE) && (USART20_RX_BUFFER_ENABLE == 1)
    if ((state == ARM_POWER_FULL) && (LPUART20_NonBlockingDriverState.handle->rxRingBuffer == NULL))
    {
        LPUART_TransferStartRingBuffer(LPUART20_NonBlockingDriverState.resource->base,
                                       LPUART20_NonBlockingDriverState.handle, lpuart20_rxRingBuffer,
                                       USART_RX_BUFFER_LEN);
    }
#endif

    return result;
}

static int32_t LPUART20_NonBlockingSend(const void *data, uint32_t num)
{
    return LPUART_NonBlockingSend(data, num, &LPUART20_NonBlockingDriverState);
}

static int32_t LPUART20_NonBlockingReceive(void *data, uint32_t num)
{
    return LPUART_NonBlockingReceive(data, num, &LPUART20_NonBlockingDriverState);
}

static int32_t LPUART20_NonBlockingTransfer(const void *data_out, void *data_in, uint32_t num)
{
    return LPUART_NonBlockingTransfer(data_out, data_in, num, &LPUART20_NonBlockingDriverState);
}

static uint32_t LPUART20_NonBlockingGetTxCount(void)
{
    return LPUART_NonBlockingGetTxCount(&LPUART20_NonBlockingDriverState);
}

static uint32_t LPUART20_NonBlockingGetRxCount(void)
{
    return LPUART_NonBlockingGetRxCount(&LPUART20_NonBlockingDriverState);
}

static int32_t LPUART20_NonBlockingControl(uint32_t control, uint32_t arg)
{
    int32_t result;

    result = LPUART_NonBlockingControl(control, arg, &LPUART20_NonBlockingDriverState);
    if (ARM_DRIVER_OK != result)
    {
        return result;
    }

    /* Enable the receive interrupts if ring buffer is used */
    if (LPUART20_NonBlockingDriverState.handle->rxRingBuffer != NULL)
    {
        LPUART_EnableInterrupts(
            LPUART20_NonBlockingDriverState.resource->base,
            (uint32_t)kLPUART_RxDataRegFullInterruptEnable | (uint32_t)kLPUART_RxOverrunInterruptEnable);
    }

    return ARM_DRIVER_OK;
}

static ARM_USART_STATUS LPUART20_NonBlockingGetStatus(void)
{
    return LPUART_NonBlockingGetStatus(&LPUART20_NonBlockingDriverState);
}

#endif

ARM_DRIVER_USART Driver_USART20 = {LPUARTx_GetVersion,      LPUARTx_GetCapabilities,
#if defined(RTE_USART20_DMA_EN) && RTE_USART20_DMA_EN
#if (defined(FSL_FEATURE_SOC_EDMA_COUNT) && FSL_FEATURE_SOC_EDMA_COUNT)
                                   LPUART20_EdmaInitialize, LPUART20_EdmaUninitialize, LPUART20_EdmaPowerControl,
                                   LPUART20_EdmaSend,       LPUART20_EdmaReceive,      LPUART20_EdmaTransfer,
                                   LPUART20_EdmaGetTxCount, LPUART20_EdmaGetRxCount,   LPUART20_EdmaControl,
                                   LPUART20_EdmaGetStatus,
#else
                                   LPUART20_DmaInitialize,  LPUART20_DmaUninitialize, LPUART20_DmaPowerControl,
                                   LPUART20_DmaSend,        LPUART20_DmaReceive,      LPUART20_DmaTransfer,
                                   LPUART20_DmaGetTxCount,  LPUART20_DmaGetRxCount,   LPUART20_DmaControl,
                                   LPUART20_DmaGetStatus,
#endif /* FSL_FEATURE_SOC_EDMA_COUNT */
#else
                                  LPUART20_NonBlockingInitialize,
                                  LPUART20_NonBlockingUninitialize,
                                  LPUART20_NonBlockingPowerControl,
                                  LPUART20_NonBlockingSend,
                                  LPUART20_NonBlockingReceive,
                                  LPUART20_NonBlockingTransfer,
                                  LPUART20_NonBlockingGetTxCount,
                                  LPUART20_NonBlockingGetRxCount,
                                  LPUART20_NonBlockingControl,
                                  LPUART20_NonBlockingGetStatus,
#endif /* RTE_USART20_DMA_EN */
                                   LPUARTx_SetModemControl, LPUARTx_GetModemStatus};

#endif /* LPUART20 */
